app/controllers/wards_controller.rb

  def index
    @wards = Ward.all
---
SELECT "wards".* FROM "wards"

  def create
    @ward = Ward.new(ward_params)

    respond_to do |format|
      if @ward.save
---
INSERT INTO "wards" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Interlagos"], ["created_at", "2017-12-04 14:41:28.921744"], ["updated_at", "2017-12-04 14:41:28.921744"]]

    def set_ward
      @ward = Ward.find(params[:id])
---
SELECT  "wards".* FROM "wards" WHERE "wards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]